// @gsts:resources

export const CustomPrefab = {
  /**
   * 基于 prefabId 1000000
   */
  默认模版: 1086324737,

  /**
   * 基于 prefabId 1000001
   */
  '默认模版(角色编辑)': 1090519041,

  /**
   * 基于 羽球5
   */
  空球: 1077936129,

  /**
   * 基于 prefabId 10005018
   */
  边界墙z: 1077936133,

  /**
   * 基于 prefabId 10005018
   */
  边界墙x: 1077936135,

  /**
   * 基于 prefabId 10005018
   */
  球门命中墙: 1077936199,

  /**
   * 基于 prefabId 10008001
   */
  '弹簧-阻尼系统': 1077936148,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1_2: 1077936149,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1_3: 1077936150,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1_4: 1077936151,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1_5: 1077936152,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1_7: 1077936153,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1_6: 1077936154,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_th1: 1077936155,

  /**
   * 基于 prefabId 10008001
   */
  日志组: 1077936166,

  /**
   * 基于 prefabId 1000000
   */
  默认模版_1: 1086324738,

  /**
   * 基于 prefabId 1000001
   */
  '默认模版_1(角色编辑)': 1090519042,

  /**
   * 基于 prefabId 1000000
   */
  默认模版_2: 1086324739,

  /**
   * 基于 prefabId 1000001
   */
  '默认模版_2(角色编辑)': 1090519043,

  /**
   * 基于 prefabId 1000000
   */
  玩家A: 1086324740,

  /**
   * 基于 prefabId 1000001
   */
  '玩家A(角色编辑)': 1090519044,

  /**
   * 基于 木质箱子2
   */
  日志储存器: 1077936178,

  /**
   * 基于 prefabId 10005018
   */
  '反弹层-微小面': 1077936179,

  /**
   * 基于 石质功能平台2
   */
  反弹逻辑: 1077936180,

  /**
   * 基于 史莱姆爆弹气球
   */
  小球: 1077936181,

  /**
   * 基于 prefabId 10005018
   */
  TickManager: 1077936182,

  /**
   * 基于 木质箱子2
   */
  日志储存器_msgs_sync: 1077936183,

  /**
   * 基于 prefabId 10005018
   */
  伞: 1077936184,

  /**
   * 基于 prefabId 10005018
   */
  物理计算节点: 1077936185,

  /**
   * 基于 prefabId 10005018
   */
  前置球门命中墙: 1077936186,

  /**
   * 基于 prefabId 10005018
   */
  前置球门命中墙r: 1077936200,

  /**
   * 基于 prefabId 10008001
   */
  球门: 1077936203,

  /**
   * 基于 prefabId 10005018
   */
  球门命中墙l: 1077936202,

  /**
   * 基于 prefabId 10005018
   */
  球门命中墙y: 1077936201,

  /**
   * 基于 石质功能平台2
   */
  底线反弹逻辑: 1077936195,

  /**
   * 基于 手鞠
   */
  预览小球: 1077936196,

  /**
   * 基于 红色晶石
   */
  球门逻辑: 1077936197,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_球门命中墙: 1077936204,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_前置球门命中墙: 1077936205,

  /**
   * 基于 红色晶石
   */
  元件复制体_球门逻辑: 1077936206,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_前置球门命中墙r: 1077936207,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_球门命中墙y: 1077936208,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_球门命中墙l: 1077936209,

  /**
   * 基于 prefabId 10005018
   */
  数字4: 1077936213,

  /**
   * 基于 prefabId 10005018
   */
  数字7: 1077936216,

  /**
   * 基于 prefabId 10005018
   */
  数字2: 1077936211,

  /**
   * 基于 prefabId 10005018
   */
  数字6: 1077936215,

  /**
   * 基于 prefabId 10005018
   */
  数字0: 1077936219,

  /**
   * 基于 prefabId 10005018
   */
  数字8: 1077936217,

  /**
   * 基于 prefabId 10005018
   */
  数字3: 1077936212,

  /**
   * 基于 prefabId 10005018
   */
  数字5: 1077936214,

  /**
   * 基于 prefabId 10005018
   */
  数字9: 1077936218,

  /**
   * 基于 prefabId 10005018
   */
  数字1: 1077936210,

  /**
   * 基于 prefabId 10005018
   */
  篮球: 1077936221,

  /**
   * 基于 石质球
   */
  足球: 1077936220,

  /**
   * 基于 prefabId 10005018
   */
  中心圆弧: 1077936222,

  /**
   * 基于 prefabId 10008001
   */
  足球场: 1077936223,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点: 1077936224,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_1: 1077936225,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_2: 1077936226,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_3: 1077936227,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_4: 1077936228,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_5: 1077936229,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_6: 1077936230,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_7: 1077936231,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_8: 1077936232,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_9: 1077936233,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_10: 1077936234,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_11: 1077936235,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_12: 1077936236,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_13: 1077936237,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_14: 1077936238,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_15: 1077936239,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_16: 1077936240,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_17: 1077936241,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_18: 1077936242,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_19: 1077936243,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_20: 1077936244,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_21: 1077936245,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_22: 1077936246,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_23: 1077936247,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_白色点_24: 1077936248,

  /**
   * 基于 积木玩偶2
   */
  角色: 1077936249,

  /**
   * 基于 prefabId 10005018
   */
  火龙卷特效: 1077936250,

  /**
   * 基于 prefabId 10005018
   */
  瞄准引导: 1077936251,

  /**
   * 基于 箭头指示牌2
   */
  上旋指示牌: 1077936252,

  /**
   * 基于 箭头指示牌2
   */
  左旋指示牌: 1077936253,

  /**
   * 基于 prefabId 10008001
   */
  瞄准箭头: 1077936254,

  /**
   * 基于 prefabId 10005018
   */
  元件复制体_瞄准引导: 1077936255,

  /**
   * 基于 箭头指示牌2
   */
  元件复制体_左旋指示牌: 1077936256,

  /**
   * 基于 箭头指示牌2
   */
  元件复制体_上旋指示牌: 1077936257,

  /**
   * 基于 箭头指示牌2
   */
  元件复制体_上旋指示牌_1: 1077936258,

  /**
   * 基于 箭头指示牌2
   */
  元件复制体_左旋指示牌_1: 1077936259,

  /**
   * 基于 羽球2
   */
  中心瞄准球: 1077936260,

  /**
   * 基于 羽球2
   */
  元件复制体_中心瞄准球: 1077936261,

  /**
   * 基于 石质球
   */
  挂载足球: 1077936262,

  /**
   * 基于 羽球2
   */
  足球轨迹: 1077936263,

  /**
   * 基于 标靶气球
   */
  足球靶子: 1077936264,

  /**
   * 基于 prefabId 10003001
   */
  新建投射物: 1077936265,

  /**
   * 基于 积木玩偶3
   */
  反弹交互人偶: 1077936266,

  /**
   * 基于 prefabId 10005018
   */
  准星: 1077936267,

  /**
   * 基于 prefabId 10005018
   */
  射门范围: 1077936268,

  /**
   * 基于 prefabId 10005018
   */
  足球场禁区单位弧长: 1077936269,

  /**
   * 基于 篝火堆
   */
  弧线创建器: 1077936270,

  /**
   * 基于 篝火堆
   */
  '弧线创建器-执行节点': 1077936271,

  /**
   * 基于 prefabId 10005018
   */
  点柱: 1077936272,

  /**
   * 基于 prefabId 10005018
   */
  射门检测: 1077936273,

  /**
   * 基于 prefabId 10005018
   */
  控球笼子: 1077936274,

  /**
   * 基于 prefabId 30007001
   */
  碰撞检测_1: 1082130434,

  /**
   * 基于 prefabId 10003001
   */
  弓箭箭矢_物理_02: 1077936276,

  /**
   * 基于 prefabId 10003001
   */
  弓箭箭矢_物理_01: 1077936275,

  /**
   * 基于 prefabId 10003001
   */
  弓箭箭矢_火元素_01: 1077936278,

  /**
   * 基于 prefabId 10003001
   */
  弓箭箭矢_火元素_02: 1077936277,

  /**
   * 基于 prefabId 1000000
   */
  资产配套模版: 1086324741,

  /**
   * 基于 珍贵的宝箱
   */
  元件3: 1077936284,

  /**
   * 基于 prefabId 1000001
   */
  '资产配套模版(角色编辑)': 1090519045,

  /**
   * 基于 水质立方体
   */
  元件1: 1077936285,

  /**
   * 基于 木质指路牌
   */
  元件6: 1077936279,

  /**
   * 基于 羽球
   */
  元件4: 1077936283,

  /**
   * 基于 盾牌
   */
  元件5: 1077936282,

  /**
   * 基于 石质球
   */
  鼠标检测体: 1077936281,

  /**
   * 基于 翻开的书籍
   */
  元件7: 1077936280,

  /**
   * 基于 木质围栏
   */
  元件2: 1077936286,

  /**
   * 基于 prefabId 1000000
   */
  资产配套模版_1: 1086324742,

  /**
   * 基于 珍贵的宝箱
   */
  元件3_1: 1077936292,

  /**
   * 基于 prefabId 1000001
   */
  '资产配套模版_1(角色编辑)': 1090519046,

  /**
   * 基于 水质立方体
   */
  元件1_1: 1077936293,

  /**
   * 基于 木质指路牌
   */
  元件6_1: 1077936287,

  /**
   * 基于 羽球
   */
  元件4_1: 1077936291,

  /**
   * 基于 盾牌
   */
  元件5_1: 1077936290,

  /**
   * 基于 石质球
   */
  鼠标检测体_1: 1077936289,

  /**
   * 基于 翻开的书籍
   */
  元件7_1: 1077936288,

  /**
   * 基于 木质围栏
   */
  元件2_1: 1077936294
}
